In [1]:
import os
import pandas as pd

os.chdir("../")
from comchoice.aggregate import borda

## Example 1
### Election of capital in Tennessee.

Case extracted from https://en.wikipedia.org/wiki/Borda_count

In [2]:
# We initialize the DataFrame with the strict order of preferences for four alternatives:
# Nashville, Memphis, Cattanooga, and Knoxville
# We group each ballot by its respective number of voters

df = pd.DataFrame([
    (42, "Memphis>Nashville>Chattanooga>Knoxville"),
    (26, "Nashville>Chattanooga>Knoxville>Memphis"),
    (15, "Chattanooga>Knoxville>Nashville>Memphis"),
    (17, "Knoxville>Chattanooga>Nashville>Memphis")
], columns=["voters", "ballot"])

df

   voters                                   ballot
0      42  Memphis>Nashville>Chattanooga>Knoxville
1      26  Nashville>Chattanooga>Knoxville>Memphis
2      15  Chattanooga>Knoxville>Nashville>Memphis
3      17  Knoxville>Chattanooga>Nashville>Memphis

In [3]:
borda(df)

   alternative  value  rank
0    Nashville    194     1
1  Chattanooga    173     2
2      Memphis    126     3
3    Knoxville    107     4

In [4]:
borda(df, score="weighted")

   alternative     value  rank
0    Nashville  0.646667     1
1  Chattanooga  0.576667     2
2      Memphis  0.420000     3
3    Knoxville  0.356667     4